Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 16)        448       
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 16)        64        
_________________________________________________________________
activation (Activation)      (None, 32, 32, 16)        0         
_________________________________________________________________
dropout (Dropout)            (None, 32, 32, 16)        0         
_________________________________________________________________
res_block_identity_shortcut  (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
res_block_identity_shortcut_ (None, 32, 32, 16)        4768      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 16)        0         
_________________________________________________________________
res_block_projection_shortcu (None, 16, 16, 32)        18912     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
res_block_identity_shortcut_ (None, 16, 16, 32)        18752     
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 32)        0         
_________________________________________________________________
res_block_projection_shortcu (None, 8, 8, 64)          74688     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
res_block_identity_shortcut_ (None, 8, 8, 64)          74368     
_________________________________________________________________
global_average_pooling2d (Gl (None, 64)                0         
_________________________________________________________________
flatten (Flatten)            (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 10)                650       
=================================================================
Total params: 1,763,626
Trainable params: 1,755,338
Non-trainable params: 8,288
_________________________________________________________________
